icefoxj/claude-monitor/firmware/tab5/sdkconfig.defaults
# M5Stack Tab5: ESP32-P4, 16 MB flash, 32 MB PSRAM. The PSRAM settings are
# what M5GFX requires for the MIPI-DSI panel (it refuses to start below
# 200 MHz) and follow M5Stack's own Tab5 projects; 200 MHz PSRAM is behind
# the experimental-features switch in ESP-IDF 5.5.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_FREERTOS_HZ=1000
